#### UIMacroManager Members

---

|  |
| --- |
| UIMacroManager Class   Methods   Properties   See Also |

The  UIMacroManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddModule | Adds a MacroModule to the application or document. |
| Public method | Dispose | Releases all resources used by the  UIMacroManager |
| Public method | EditMacro | Edits the macro in sharp develop. |
| Public method | EditModule | Edits the macro in sharp develop. |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetMacroManager(UIApplication) | Gets the UI Macro manager from the UI application. |
| Public method Static member | GetMacroManager(UIDocument) | Gets the UI Macro manager from the UI document. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | GetUIDocumentMacroSecurityOptions | Gets the UI document macro security options. |
| Public method | RemoveModule | Removes a MacroModule from the application or document. |
| Public method Static member | SetUIDocumentMacroSecurityOptions | Sets the UI document macro security options. |
| Public method | StepInto | Step into the macro in sharp develop. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | MacroManager | The DB macro manager. |

# See Also

UIMacroManager Class

Autodesk.Revit.UI.Macros Namespace